""" Задача один """

length = input("Введите длину стороны a=")
length = int(length)
P = 4*length
print (P)


a = input("Введите длину стороны квадрата a=")
a = int(a)
S = a*a
print(S)

a = input("Ведите длину прямоугольника a=") 
b = input("Введите ширину прямоугольника b=")
a = int(a)
b = int(b)
S = a*b 
P = 2*(a+b)
print ("Площадь равна")
print (S)
print ("Периметр равен")
print (P)